In [1]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

In [2]:
rds_connection_string = "root:12345678@127.0.0.1/fires"
engine = create_engine(f'mysql+pymysql://{rds_connection_string}')

In [3]:
data = pd.read_sql("select * from fire_and_air_data", con=engine)
data.head()

/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

,date,overall_aqi,site_name,year,fire_id,fire_name,discovery_date,containment_date,size,class,fire_year
0,2001-01-01,153,San Francisco,2001,8659.0,LUCERNE,2001-01-01,2001-01-01,0.1,A,2001.0
1,2001-01-01,153,San Francisco,2001,9387.0,DEBRIS 2,2001-01-01,2001-01-01,0.1,A,2001.0
2,2001-01-01,153,San Francisco,2001,17163.0,LP HILL,2001-01-01,2001-01-01,0.1,A,2001.0
3,2001-01-01,153,San Francisco,2001,30114.0,PGE 1,2001-01-01,2001-01-01,0.1,A,2001.0
4,2001-01-01,153,San Francisco,2001,30201.0,PUMP HOUSE,2001-01-01,2001-01-01,0.1,A,2001.0

In [4]:
year = pd.read_sql("select distinct fire_year from fire_and_air_data", con=engine)
year.head()

   fire_year
0     2001.0
1        NaN
2     2002.0
3     2003.0
4     2004.0

In [5]:
data = data[['date', 'overall_aqi', 'fire_id', 'size']]

In [6]:
combined_group = data.groupby(['date','fire_id'])

In [7]:
combined_group.head()

            date  overall_aqi   fire_id   size
0     2001-01-01          153    8659.0   0.10
1     2001-01-01          153    9387.0   0.10
2     2001-01-01          153   17163.0   0.10
3     2001-01-01          153   30114.0   0.10
4     2001-01-01          153   30201.0   0.10
5     2001-01-01          153   33271.0   1.00
6     2001-01-02          140    7787.0   0.10
7     2001-01-02          140    9396.0   0.10
8     2001-01-02          140   17164.0   0.10
9     2001-01-02          140   21487.0   0.10
10    2001-01-03          140    8645.0   0.10
11    2001-01-03          140   16399.0   0.10
12    2001-01-03          140   17165.0   0.10
13    2001-01-03          140   33089.0   0.10
14    2001-01-03          140   33323.0   0.10
15    2001-01-04          107    8660.0   3.00
16    2001-01-04          107    8661.0   0.20
17    2001-01-04          107    9403.0   1.00
18    2001-01-04          107   17167.0   0.10
19    2001-01-04          107   21488.0   0.10
20    2001-01-04          107   21489.0   1.00
21    2001-01-04          107   21490.0   0.10
22    2001-01-04          107   21491.0   0.10
23    2001-01-04          107   25185.0   4.00
24    2001-01-04          107   30193.0   0.20
25    2001-01-05          124    7789.0  25.00
26    2001-01-05          124    8372.0   1.00
27    2001-01-05          124    9386.0  24.00
28    2001-01-05          124    9399.0   0.50
29    2001-01-05          124   17166.0  15.00
...          ...          ...       ...    ...
56042 2014-12-21           43   97285.0   0.01
56043 2014-12-22           45   97286.0   1.00
56044 2014-12-22           45   99714.0   0.01
56045 2014-12-23           47   95797.0   0.10
56046 2014-12-23           47   95798.0   0.10
56047 2014-12-23           47   97544.0   1.00
56048 2014-12-23           47   98602.0   0.10
56049 2014-12-23           47   98603.0   0.10
56050 2014-12-23           47  102585.0   1.00
56051 2014-12-24           48   95796.0   0.10
56052 2014-12-24           48   96642.0   1.00
56053 2014-12-25           35   94318.0   0.10
56054 2014-12-25           35   95025.0   1.00
56055 2014-12-25           35   98604.0   0.10
56056 2014-12-25           35   99715.0   0.10
56057 2014-12-25           35   99716.0   0.10
56058 2014-12-26           47   94283.0   0.10
56059 2014-12-26           47   94316.0   0.10
56060 2014-12-27           55   94174.0   0.10
56061 2014-12-27           55   94284.0   0.10
56062 2014-12-27           55   97287.0   0.05
56063 2014-12-28           68   97288.0   0.10
56064 2014-12-28           68   98605.0   0.01
56066 2014-12-30           31   95552.0   2.50
56067 2014-12-30           31   98606.0   0.10
56068 2014-12-30           31   98607.0   0.01
56069 2014-12-30           31   98608.0   0.01
56070 2014-12-30           31   98609.0   0.25
56071 2014-12-30           31   98610.0   0.01
56072 2014-12-30           31   99717.0   0.01

[55612 rows x 4 columns]

In [8]:
# verify that there's never more then one record for a particular fire-id on a particular day
combined_group.size().max()

1

In [9]:
grouped_by_date = data.groupby(['date'])

In [10]:
grouped_by_date.describe().head()

           fire_id                                                         \
             count          mean           std     min       25%      50%
date
2001-01-01     6.0  21465.833333  11125.497318  8659.0  11331.00  23638.5
2001-01-02     4.0  13958.500000   6477.071380  7787.0   8993.75  13280.0
2001-01-03     5.0  21724.200000  10998.867814  8645.0  16399.00  17165.0
2001-01-04    10.0  18522.700000   7418.614621  8660.0  11344.00  21488.5
2001-01-05     9.0  15670.888889   8204.496396  7789.0   9386.00  17166.0

                              overall_aqi         ...                 size  \
                 75%      max       count   mean  ...     75%    max count
date                                              ...
2001-01-01  30179.25  33271.0         6.0  153.0  ...   153.0  153.0   6.0
2001-01-02  18244.75  21487.0         4.0  140.0  ...   140.0  140.0   4.0
2001-01-03  33089.00  33323.0         5.0  140.0  ...   140.0  140.0   5.0
2001-01-04  21490.75  30193.0        10.0  107.0  ...   107.0  107.0  10.0
2001-01-05  17169.00  33097.0         9.0  124.0  ...   124.0  124.0   9.0


                 mean        std  min  25%  50%   75%   max
date
2001-01-01   0.250000   0.367423  0.1  0.1  0.1   0.1   1.0
2001-01-02   0.100000   0.000000  0.1  0.1  0.1   0.1   0.1
2001-01-03   0.100000   0.000000  0.1  0.1  0.1   0.1   0.1
2001-01-04   0.980000   1.395071  0.1  0.1  0.2   1.0   4.0
2001-01-05  16.222222  26.122106  0.1  0.3  1.0  24.0  80.0

[5 rows x 24 columns]

In [11]:
grouped_by_date.sum()

            overall_aqi   fire_id      size
date
2001-01-01          918  128795.0      1.50
2001-01-02          560   55834.0      0.40
2001-01-03          700  108621.0      0.50
2001-01-04         1070  185227.0      9.80
2001-01-05         1116  141038.0    146.00
2001-01-06          441   50352.0      5.50
2001-01-07         1200  146283.0  10363.20
2001-01-08          390  208266.0     11.10
2001-01-09           43   17174.0      0.10
2001-01-10           33   29849.0      0.10
2001-01-11           34       0.0      0.00
2001-01-12           34       0.0      0.00
2001-01-13           25   21502.0      3.00
2001-01-14          102   81446.0      0.30
2001-01-15          117   64201.0      0.90
2001-01-16           39    8468.0      1.00
2001-01-17           40       0.0      0.00
2001-01-18           79       0.0      0.00
2001-01-19          444   99015.0      1.30
2001-01-20          158    9628.0      0.10
2001-01-21          162       0.0      0.00
2001-01-22          333   60756.0      0.70
2001-01-23           42       0.0      0.00
2001-01-24           45       0.0      0.00
2001-01-25           42   29867.0      0.10
2001-01-26           37       0.0      0.00
2001-01-27           76   17210.0      0.20
2001-01-28           52   21506.0      0.10
2001-01-29           36       0.0      0.00
2001-01-30           39   29852.0      0.10
...                 ...       ...       ...
2014-12-02           29   99707.0      0.01
2014-12-03           72  188928.0      0.20
2014-12-04           37   99708.0      0.50
2014-12-05           84  199419.0      1.10
2014-12-06           78  194304.0      1.10
2014-12-07           56       0.0      0.00
2014-12-08           62       0.0      0.00
2014-12-09          234  293421.0      0.70
2014-12-10          126  192805.0      4.10
2014-12-11          120  287203.0     20.25
2014-12-12           41   98600.0      0.01
2014-12-13           61   99712.0      1.00
2014-12-14           65   94410.0      0.10
2014-12-15           96  194565.0      0.11
2014-12-16          120  293425.0      0.45
2014-12-17           42       0.0      0.00
2014-12-18           54       0.0      0.00
2014-12-19           49   94317.0      0.10
2014-12-20           61       0.0      0.00
2014-12-21          129  288980.0      0.12
2014-12-22           90  197000.0      1.01
2014-12-23          282  588929.0      2.40
2014-12-24           96  192438.0      1.10
2014-12-25          175  487378.0      1.40
2014-12-26           94  188599.0      0.20
2014-12-27          165  285745.0      0.25
2014-12-28          136  195893.0      0.11
2014-12-29           54       0.0      0.00
2014-12-30          217  688309.0      2.89
2014-12-31           55       0.0      0.00

[5110 rows x 3 columns]

In [12]:
acres_per_day_df = data.groupby('date')['size'].sum().to_frame().reset_index()

In [13]:
acres_per_day_df.head()

        date   size
0 2001-01-01    1.5
1 2001-01-02    0.4
2 2001-01-03    0.5
3 2001-01-04    9.8
4 2001-01-05  146.0

In [14]:
# Manually spot-check a date

data[data['date'] == '2014-01-03']

            date  overall_aqi  fire_id  size
50253 2014-01-03           80  94216.0  0.25
50254 2014-01-03           80  96117.0  0.10
50255 2014-01-03           80  96408.0  4.00
50256 2014-01-03           80  96811.0  1.00
50257 2014-01-03           80  96812.0  0.20
50258 2014-01-03           80  96813.0  1.30
50259 2014-01-03           80  96814.0  0.10
50260 2014-01-03           80  97582.0  0.10
50261 2014-01-03           80  97695.0  1.00
50262 2014-01-03           80  97696.0  0.30
50263 2014-01-03           80  97697.0  1.00

In [15]:
air_data_df = pd.read_sql("select * from aqi_data", con=engine)
air_data_df.head()

        date  overall_aqi      site_name  year
0 2001-01-01          153  San Francisco  2001
1 2001-01-02          140  San Francisco  2001
2 2001-01-03          140  San Francisco  2001
3 2001-01-04          107  San Francisco  2001
4 2001-01-05          124  San Francisco  2001

In [16]:
merged_data_df = pd.merge(air_data_df, acres_per_day_df, on='date')

In [17]:
merged_data_df.head()

        date  overall_aqi      site_name  year   size
0 2001-01-01          153  San Francisco  2001    1.5
1 2001-01-02          140  San Francisco  2001    0.4
2 2001-01-03          140  San Francisco  2001    0.5
3 2001-01-04          107  San Francisco  2001    9.8
4 2001-01-05          124  San Francisco  2001  146.0

In [18]:
merged_data_df.to_sql(name="acres_and_air_data", con=engine, if_exists="replace")